Revit 2024 API
CircleLightShape Constructor (CircleLightShape)
 Creates a copy of the given circle light shape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public CircleLightShape(
	CircleLightShape other
)
Visual Basic
Public Sub New ( _
	other As CircleLightShape _
)
Visual C++
public:
CircleLightShape(
	CircleLightShape^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Lighting.CircleLightShape
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
CircleLightShape Class
CircleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace